#### BuiltInFailures.KeynoteTagFailures Members

---

|  |
| --- |
| BuiltInFailures KeynoteTagFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures KeynoteTagFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | KeynoteOnLinkWithDifferentKeynoteFile | The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file. |
| Public property Static member | NoKeynoteAssignedToLinkedElement | The parameters of the keynote tag are empty because the keynoted linked element uses a different keynote file. |

# See Also

BuiltInFailures KeynoteTagFailures Class

Autodesk.Revit.DB Namespace